In [1]:
%run "../../../common/0_notebooks_base_setup.py"

/Users/csuarezgurruchaga/Desktop/Digital-House/clase_05/dsad_2021/common
default checking
Running command `conda list`... ok
jupyterlab=2.2.6 already installed
pandas=1.1.5 already installed
bokeh=2.2.3 already installed
seaborn=0.11.0 already installed
matplotlib=3.3.2 already installed
ipywidgets=7.5.1 already installed
pytest=6.2.1 already installed
chardet=4.0.0 already installed
psutil=5.7.2 already installed
scipy=1.5.2 already installed
statsmodels=0.12.1 already installed
scikit-learn=0.23.2 already installed
xlrd=2.0.1 already installed
Running command `conda install --yes nltk=3.5.0`... ok
Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


unidecode=1.1.1 already installed
pydotplus=2.0.2 already installed
pandas-datareader=0.9.0 already installed
flask=1.1.2 already installed

---

<img src='../../../common/logo_DH.png' align='left' width=35%/>

## Dataset

En la práctica de la clase de hoy usaremos una versión muy resumida de datos de la Encuesta Permanentes de Hogares (relevamiento llevado adelante por el INDEC). Se trata de una encuesta continua que tiene como objetivo fundamental generar información sobre el funcionamiento del mercado de trabajo.

Solamente utilizaremos algunas variables (edad, nivel educativo, cantidad de horas trabajadas, calificación de la tarea e ingreso laboral) y algunos casos (los ocupados, es decir, aquellos que han trabajado al menos una hora en la semana anterior al relevamiento).

Importamos la biblioteca pandas y asignamos pd como alias:

In [2]:
import pandas as pd

## Ejercicio 1

Vamos a leer los datos del archivo /M1/CLASE_04/Data/data_filt.csv en un `DataFrame` de pandas con el método `read_csv`

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html


Este archivo tiene algunos datos numéricos y otros de tipo cadena de caracteres. 

Las columnas son:

"ch06","nivel_ed","htot","calif","p47t"

* ch06: int, edad

* nivel_ed: string, nivel educativo

* htot: int, cantidad de horas totales trabajadas en el período

* calif: string, calificación de la tarea

* p47t: int, ingreso

In [3]:
# local:
data_location = "../Data/data_filt.csv"

data = pd.read_csv(data_location, sep=",", encoding="latin1")

## Ejercicio 2

Miremos ahora los primeros tres registros del `DataFrame` data, y los ultimos cinco registros.

¿Cuántas filas tiene data? ¿Y cuántas columnas?

Ayudas:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html?highlight=head#pandas.DataFrame.head

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html?highlight=tail#pandas.DataFrame.tail

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html?highlight=shape#pandas.DataFrame.shape

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html?highlight=info

In [4]:
data.head(3)

   ch06           nivel_ed  htot            calif    p47t
0    46        1_H/Sec inc    45  2_Op./No calif.  6000.0
1    26  2_Sec. comp y más    25  2_Op./No calif.  5000.0
2    47  2_Sec. comp y más    25  2_Op./No calif.  5000.0

In [5]:
data.tail()

       ch06           nivel_ed  htot            calif     p47t
23443    45  2_Sec. comp y más    50  2_Op./No calif.   4000.0
23444    58        1_H/Sec inc    30  2_Op./No calif.   5000.0
23445    36  2_Sec. comp y más    40  2_Op./No calif.  13000.0
23446    49        1_H/Sec inc    40  2_Op./No calif.   4000.0
23447    36        1_H/Sec inc    54  2_Op./No calif.   8000.0

In [6]:
print(f"El data frame data, tiene {data.shape[0]} filas y {data.shape[1]} columnas")

El data frame data, tiene 23448 filas y 5 columnas

## Ejercicio 3

¿Cuáles son los nombres de las columnas del `DataFrame` data?

¿Cuál es el índice del `DataFrame` data?

Ayudas:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html?highlight=columns#pandas.DataFrame.columns

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.index.html?highlight=index#pandas.DataFrame.index

In [7]:
print(f"Los nombres de las columnas de data son {data.columns.values}")
print(f"El indice de data es: {data.index}")

Los nombres de las columnas de data son ['ch06' 'nivel_ed' 'htot' 'calif' 'p47t']
El indice de data es: RangeIndex(start=0, stop=23448, step=1)

Renombremos ahora los columnas para que queden con estos valores:

['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional', 'ingreso_ult_mes']

In [8]:
data.rename(columns= {'ch06':'edad','nivel_ed':'nivel_educativo','htot':'hs_trabajados', 'calif':'calif_ocupacional','p47t':'ingreso_ult_mes'}, inplace = True)

In [9]:
data.head()

   edad    nivel_educativo  hs_trabajados calif_ocupacional  ingreso_ult_mes
0    46        1_H/Sec inc             45   2_Op./No calif.           6000.0
1    26  2_Sec. comp y más             25   2_Op./No calif.           5000.0
2    47  2_Sec. comp y más             25   2_Op./No calif.           5000.0
3    52        1_H/Sec inc             90   2_Op./No calif.          11000.0
4    45        1_H/Sec inc             44   2_Op./No calif.           9500.0

## Ejercicio 4 

¿Cuál es el tipo de datos de la cuarta columna de data?

In [10]:
(data.iloc[:,3]).dtype
# 'b'       boolean
# 'i'       (signed) integer
# 'u'       unsigned integer
# 'f'       floating-point
# 'c'       complex-floating point
# 'O'       (Python) objects
# 'S', 'a'  (byte-)string
# 'U'       Unicode
# 'V'       raw data (void)

#print(type((data.iloc[:,3])))

dtype('O')

## Ejercicio 5 

¿Cómo están distribuidos los niveles educativos? ¿Cuál es el más común?

Ayuda:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html?highlight=value_counts#pandas.Series.value_counts

In [11]:
data.head()

   edad    nivel_educativo  hs_trabajados calif_ocupacional  ingreso_ult_mes
0    46        1_H/Sec inc             45   2_Op./No calif.           6000.0
1    26  2_Sec. comp y más             25   2_Op./No calif.           5000.0
2    47  2_Sec. comp y más             25   2_Op./No calif.           5000.0
3    52        1_H/Sec inc             90   2_Op./No calif.          11000.0
4    45        1_H/Sec inc             44   2_Op./No calif.           9500.0

In [12]:
data.nivel_educativo.unique()

array(['1_H/Sec inc', '2_Sec. comp y más'], dtype=object)

In [13]:
data.nivel_educativo.value_counts()

2_Sec. comp y más    14634
1_H/Sec inc           8814
Name: nivel_educativo, dtype: int64

## Ejercicio 6

¿Cuál es el ingreso medio de la población?

In [14]:
data.ingreso_ult_mes.mean()

8107.905834186285

## Ejercicio 7

Construyamos un objeto `DataFrame` con las columnas nivel_educativo e ingreso_ult_mes de data

Seleccionemos las primeras 20 filas de este objeto `DataFrame`

Seleccionemos una muestra aleatoria de 500 filas de este objeto `DataFrame`

Ayuda:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html?highlight=sample#pandas.DataFrame.sample

In [15]:
df = data[["nivel_educativo" , "ingreso_ult_mes"]]
df.head(20)

      nivel_educativo  ingreso_ult_mes
0         1_H/Sec inc           6000.0
1   2_Sec. comp y más           5000.0
2   2_Sec. comp y más           5000.0
3         1_H/Sec inc          11000.0
4         1_H/Sec inc           9500.0
5   2_Sec. comp y más           6000.0
6   2_Sec. comp y más           9000.0
7         1_H/Sec inc           4260.0
8         1_H/Sec inc           3800.0
9   2_Sec. comp y más          10517.0
10        1_H/Sec inc           8300.0
11  2_Sec. comp y más           4900.0
12  2_Sec. comp y más          11000.0
13  2_Sec. comp y más           9000.0
14        1_H/Sec inc           3500.0
15        1_H/Sec inc           8000.0
16        1_H/Sec inc           2500.0
17        1_H/Sec inc           7500.0
18        1_H/Sec inc           5000.0
19        1_H/Sec inc           5500.0

In [16]:
df.sample(500)

         nivel_educativo  ingreso_ult_mes
11920  2_Sec. comp y más           5000.0
17474        1_H/Sec inc           7800.0
16264        1_H/Sec inc          12500.0
10449        1_H/Sec inc          15000.0
16119        1_H/Sec inc          17000.0
...                  ...              ...
2718   2_Sec. comp y más          20000.0
5765   2_Sec. comp y más           3300.0
2231   2_Sec. comp y más          10000.0
3897         1_H/Sec inc           5000.0
9706   2_Sec. comp y más           2500.0

[500 rows x 2 columns]

## Ejercicio 8

Construyamos un objeto `DataFrame` con todas las columnas de data excluyendo nivel_educativo.

Ayuda: 

Construir una máscara booleana de los nombres de las columnas.

In [17]:
df2 = data
df2.drop('nivel_educativo', axis = 1 ,inplace = True)
df2

       edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
0        46             45   2_Op./No calif.           6000.0
1        26             25   2_Op./No calif.           5000.0
2        47             25   2_Op./No calif.           5000.0
3        52             90   2_Op./No calif.          11000.0
4        45             44   2_Op./No calif.           9500.0
...     ...            ...               ...              ...
23443    45             50   2_Op./No calif.           4000.0
23444    58             30   2_Op./No calif.           5000.0
23445    36             40   2_Op./No calif.          13000.0
23446    49             40   2_Op./No calif.           4000.0
23447    36             54   2_Op./No calif.           8000.0

[23448 rows x 4 columns]

In [18]:
#Otra forma es a partir de una mascara booleana

data.loc[:, data.columns.values != 'nivel_educativo']

       edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
0        46             45   2_Op./No calif.           6000.0
1        26             25   2_Op./No calif.           5000.0
2        47             25   2_Op./No calif.           5000.0
3        52             90   2_Op./No calif.          11000.0
4        45             44   2_Op./No calif.           9500.0
...     ...            ...               ...              ...
23443    45             50   2_Op./No calif.           4000.0
23444    58             30   2_Op./No calif.           5000.0
23445    36             40   2_Op./No calif.          13000.0
23446    49             40   2_Op./No calif.           4000.0
23447    36             54   2_Op./No calif.           8000.0

[23448 rows x 4 columns]

## Ejercicio 9

Ordenar data según la columna edad en forma decreciente.

Ayuda: 

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values

In [19]:
data.sort_values("edad", ascending = False)

       edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
22574    93             20   2_Op./No calif.           8000.0
16461    85             40     1_Prof./Tecn.          20700.0
16954    85             36   2_Op./No calif.           8250.0
23317    84             25   2_Op./No calif.           9900.0
4340     84             36   2_Op./No calif.           7500.0
...     ...            ...               ...              ...
15198    13              6   2_Op./No calif.            800.0
5698     12              5   2_Op./No calif.            250.0
15308    12              7   2_Op./No calif.            250.0
19856    12             15   2_Op./No calif.           1200.0
20050    12             20   2_Op./No calif.           1600.0

[23448 rows x 4 columns]

## Ejercicio 10

¿Cuál es el promedio de horas trabajadas de los jóvenes entre 14 y 25 años y poco calificados?

Ayuda:
    
Combina varias máscaras booleanas

In [20]:
data.head()

   edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
0    46             45   2_Op./No calif.           6000.0
1    26             25   2_Op./No calif.           5000.0
2    47             25   2_Op./No calif.           5000.0
3    52             90   2_Op./No calif.          11000.0
4    45             44   2_Op./No calif.           9500.0

In [21]:
data.edad=(data.edad).astype(int)
dataej10 = data.loc[(data["edad"] >= 14) & (data["edad"] <= 25) & (data.calif_ocupacional == "2_Op./No calif.")]
print(f"El promedio de horas trabajadas en este data frame es de : {dataej10.hs_trabajados.mean().round(2)}")

El promedio de horas trabajadas en este data frame es de : 37.57

## Ejercicio 11

Generemos un nuevo dataframe con los trabajadores que ganan más del promedio de ingresos general y están por debajo de la cantidad media de horas trabajadas. ¿Cuántos trabajadores se encuentran en esta condición? ¿Cuál es su edad mediana?

Ayuda:

Calcular el promedio de ingresos y la media de horas trabajadas

Construir máscaras booleanas con estos valores

Indexar data con la combinación de las máscaras construidas

In [22]:
data.describe()

               edad  hs_trabajados  ingreso_ult_mes
count  23448.000000   23448.000000     23448.000000
mean      40.455689      39.684536      8107.905834
std       12.934870      16.172226      6396.801309
min       12.000000       1.000000        80.000000
25%       30.000000      30.000000      4000.000000
50%       39.000000      40.000000      7000.000000
75%       50.000000      48.000000     10000.000000
max       93.000000     168.000000    130000.000000

In [23]:
afortunados = data.loc[(data.ingreso_ult_mes > data.ingreso_ult_mes.mean()) & (data.hs_trabajados < data.hs_trabajados.mean()),:]
print(afortunados.head())
print(afortunados.shape)

    edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
10    72             15     1_Prof./Tecn.           8300.0
12    43             15     1_Prof./Tecn.          11000.0
47    33             39     1_Prof./Tecn.           9500.0
48    55             30   2_Op./No calif.          13000.0
88    46             36     1_Prof./Tecn.          10000.0
(2132, 4)

In [26]:
afortunados["Cuenta"] = 0

<ipython-input-26-875e50a84645>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  afortunados["Cuenta"] = 0

In [28]:
afortunados.Cuenta.count()

2132